---
type: ConnectionInputPointInfo
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 7
tags: [revit-api, class]
---

# ConnectionInputPointInfo

`Autodesk.Revit.DB.Structure.ConnectionInputPointInfo` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ConnectionInputPointInfo | — | `` |
| Constructor | ConnectionInputPointInfo | 2021 | `public ConnectionInputPointInfo ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | InputMemberIndex | 2021 | `public int InputMemberIndex { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | PointSelectionText | 2021 | `public string PointSelectionText { get ; set ; }` |
| Property | RestrictionType | 2021 | `public string RestrictionType { get ; set ; }` |